LeeXingyu/GAS_master/STM32Lib/UserLib/cpu/src/STM32Fxxx_Serial.c
/************************************版权所有(c)****************************************
* 版权所有(c), 2012-2013, XXXXXXXXXXXX, 保留所有权
* 文件名      ：STM32Fxxx_Serial.c
* 作者        ：XXXX
* 版本        ：V 1.0
* 日期        ：2015-06-17
* 功能描述    ：
* 备注        ：
* 主要函数列表：
* 修改记录    ：
  日      期          版本          修改人          修改内容
  2015-06-17          1.0           XXXX            创建文件
****************************************************************************************/

/* 调试部分开关 -----------------------------------------------------------------------*/

/* 包含文件 ---------------------------------------------------------------------------*/
#include "STM32Fxxx_Serial.h"
#include "CoreInclude.h"

#if (defined(APP_OS))
#include "bsp.h"
#else
#include "app_cfg.h"
#include "STM32Fxxx_Misc.h"
#endif  //(defined(APP_OS))

/* 宏定义 -----------------------------------------------------------------------------*/
#if (!defined(APP_OS))
#define NVIC_UART1_PREPRIORITY		0
#define NVIC_UART1_SUBPRIORITY		1

#define NVIC_UART2_PREPRIORITY		0
#define NVIC_UART2_SUBPRIORITY		2

#define NVIC_UART3_PREPRIORITY		0
#define NVIC_UART3_SUBPRIORITY		2

#define NVIC_UART4_PREPRIORITY		0
#define NVIC_UART4_SUBPRIORITY		0

#define NVIC_UART5_PREPRIORITY		0
#define NVIC_UART5_SUBPRIORITY		3

#define NVIC_UART6_PREPRIORITY		0
#define NVIC_UART6_SUBPRIORITY		3
#endif  //#if (!defined(APP_OS))

/* 结构类型定义 -----------------------------------------------------------------------*/
typedef void (*STM32_Ser_Fun)(void);

#if (!defined(APP_OS))
typedef struct _STM32Fxxx_Serial_ISR_t
{
    IRQn_Type irq_type;
    uint32_t  pre_prio;
    uint32_t  sub_prio;
}STM32Fxxx_Serial_ISR_t;
#endif  //APP_OS

/* 原型声明部分 -----------------------------------------------------------------------*/
static void STM32Fxxx_Serail_EventISR_Handler(SERIAL_Port port);
#if (defined(APP_OS))
static void STM32Fxxx_Serail1_EventISR_Handler(void);
static void STM32Fxxx_Serail2_EventISR_Handler(void);
static void STM32Fxxx_Serail3_EventISR_Handler(void);
static void STM32Fxxx_Serail4_EventISR_Handler(void);
#if defined(STM32F1XX)
static void STM32Fxxx_Serail5_EventISR_Handler(void);
#elif (defined(STM32F4XX))
static void STM32Fxxx_Serail5_EventISR_Handler(void);
static void STM32Fxxx_Serail6_EventISR_Handler(void);
#endif //:~STM32F4XX
#endif  //#if (defined(APP_OS))

static void STM32Fxxx_Ser1GPIOInit(void);
static void STM32Fxxx_Ser2GPIOInit(void);
static void STM32Fxxx_Ser3GPIOInit(void);
static void STM32Fxxx_Ser4GPIOInit(void);
#if defined(STM32F1XX)
static void STM32Fxxx_Ser5GPIOInit(void);
#elif (defined(STM32F4XX))
static void STM32Fxxx_Ser5GPIOInit(void);
static void STM32Fxxx_Ser6GPIOInit(void);
#endif //:~STM32F4XX

/* 全局变量声明 -----------------------------------------------------------------------*/

/* 静态变量定义 -----------------------------------------------------------------------*/
const uint32 Serial_BaudrateDict[] 		= {1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200};
const uint16 Serial_ParityDict[] 		= {USART_Parity_No, USART_Parity_Odd, USART_Parity_Even};
const uint16 Serial_ByteBitsDict[] 		= {USART_WordLength_8b, USART_WordLength_9b};

#ifdef STM32F0XX
const uint16 Serial_StopBitsDict[]		= {USART_StopBits_1, USART_StopBits_2, USART_StopBits_1_5};
#else
const uint16 Serial_StopBitsDict[]		= {USART_StopBits_1, USART_StopBits_0_5, USART_StopBits_2, USART_StopBits_1_5};
#endif  //#ifdef STM32F0XX

#if (defined(APP_OS))
#if (defined(OS_USE_uCOSIII))
//static BSP_OS_SEM	Serial_RXSem[SERIAL_PORT_MAX];
static BSP_OS_SEM	Serial_TXLockSem[SERIAL_PORT_MAX];
#else
//static BSP_OS_SEM	Serial_RXSem[SERIAL_PORT_MAX] =
//{
//	NULL,
//	NULL,
//	NULL,
//	NULL,
//#if defined(STM32F1XX)
//	NULL
//#elif defined(STM32F4XX)
//	NULL,
//	NULL
//#endif //:~STM32F1XX
//};

static BSP_OS_SEM	Serial_TXLockSem[SERIAL_PORT_MAX] =
{
	NULL,
	NULL,
	NULL,
	NULL,
#if defined(STM32F1XX)
	NULL
#elif defined(STM32F4XX)
	NULL,
	NULL
#endif //:~STM32F1XX
};
#endif  //#if (defined(OS_USE_uCOSIII))

static BOOL abSerial_Used[SERIAL_PORT_MAX] =
{
	FALSE,
	FALSE,
	FALSE,
	FALSE,
#if defined(STM32F1XX)
	FALSE
#elif defined(STM32F4XX)
	FALSE,
	FALSE
#endif //:~STM32F1XX
};

const static CPU_INT08U Serial_INT_ID[SERIAL_PORT_MAX] =
{
	BSP_INT_ID_USART1,
	BSP_INT_ID_USART2,
	BSP_INT_ID_USART3,
#if defined(STM32F1XX)
	BSP_INT_ID_UART4,
	BSP_INT_ID_UART5
#elif defined(STM32F4XX)
	BSP_INT_ID_USART4,
	BSP_INT_ID_USART5,
	BSP_INT_ID_USART6
#endif //:~STM32F1XX
};

const static STM32_Ser_Fun	Serial_EventISR_Handler[SERIAL_PORT_MAX] =
{
	STM32Fxxx_Serail1_EventISR_Handler,
	STM32Fxxx_Serail2_EventISR_Handler,
	STM32Fxxx_Serail3_EventISR_Handler,
	STM32Fxxx_Serail4_EventISR_Handler,
#if defined(STM32F1XX)
	STM32Fxxx_Serail5_EventISR_Handler
#elif defined(STM32F4XX)
	STM32Fxxx_Serail5_EventISR_Handler,
	STM32Fxxx_Serail6_EventISR_Handler
#endif //:~STM32F1XX
};
#else
const static STM32Fxxx_Serial_ISR_t a_SerialISRTypePrio[SERIAL_PORT_MAX] =
{
    {USART1_IRQn, NVIC_UART1_PREPRIORITY, NVIC_UART1_SUBPRIORITY},
    {USART2_IRQn, NVIC_UART2_PREPRIORITY, NVIC_UART2_SUBPRIORITY},
#ifdef STM32F0XX
//    {USART3_4_IRQn, NVIC_UART3_PREPRIORITY, NVIC_UART3_SUBPRIORITY},
#else
    {USART3_IRQn, NVIC_UART3_PREPRIORITY, NVIC_UART3_SUBPRIORITY},
#endif  //#ifdef STM32F0XX
#if defined(STM32F1XX)
    {UART4_IRQn, NVIC_UART4_PREPRIORITY, NVIC_UART4_SUBPRIORITY},
    {UART5_IRQn, NVIC_UART5_PREPRIORITY, NVIC_UART5_SUBPRIORITY},
#elif defined(STM32F4XX)
    {USART4_IRQn, NVIC_UART4_PREPRIORITY, NVIC_UART4_SUBPRIORITY},
    {USART5_IRQn, NVIC_UART5_PREPRIORITY, NVIC_UART5_SUBPRIORITY},
    {USART6_IRQn, NVIC_UART6_PREPRIORITY, NVIC_UART6_SUBPRIORITY},
#elif defined(STM32F0XX)
//    {USART3_4_IRQn, NVIC_UART3_PREPRIORITY, NVIC_UART3_SUBPRIORITY},
#endif  //#if defined(STM32F4XX)
};
#endif  //APP_OS

static STM32Fxxx_SerRxPtr Serial_RxHandler[SERIAL_PORT_MAX] =
{
	NULL,
	NULL,
	NULL,
	NULL,
#if defined(STM32F1XX)
	NULL
#elif defined(STM32F4XX)
	NULL,
	NULL
#endif //:~STM32F1XX
};

const static STM32_Ser_Fun	Serial_GPIOInit[SERIAL_PORT_MAX] =
{
	STM32Fxxx_Ser1GPIOInit,
	STM32Fxxx_Ser2GPIOInit,
	STM32Fxxx_Ser3GPIOInit,
	STM32Fxxx_Ser4GPIOInit,
#if defined(STM32F1XX)
	STM32Fxxx_Ser5GPIOInit
#elif defined(STM32F4XX)
	STM32Fxxx_Ser5GPIOInit,
	STM32Fxxx_Ser6GPIOInit
#endif //:~STM32F1XX
};

const static USART_TypeDef *Serial_PERIPH_ID[SERIAL_PORT_MAX] =
{
    USART1,
    USART2,
    USART3,
#ifdef STM32F0XX
    USART4,
#elif defined(STM32F1XX)
    UART4,
#endif  //#ifdef STM32F0XX
    
#if defined(STM32F1XX)
    UART5
#elif defined(STM32F4XX)
    UART5,
    USART6
#endif //:~STM32F1XX
};


/****************************************************************************************
* 函数名称: STM32Fxxx_SerialInit()
* 功能描述: 初始化串口
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
BOOL STM32Fxxx_SerialInit(SERIAL_Port port, SERIAL_BaudRate baud, SERIAL_Parity parity,
		SERIAL_ByteBits bits, SERIAL_StopBits stop, STM32Fxxx_SerRxPtr handler)
{
    FlagStatus              tc_status;

    USART_InitTypeDef       usart_init;
    USART_ClockInitTypeDef  usart_clk_init;
    
#if (defined(APP_OS))
	CPU_INT08U  			os_err;
	CPU_CHAR				name[30];
#endif  //#if (defined(APP_OS))

	if((port>=SERIAL_PORT_MAX) ||(baud>=SERIAL_BAUDRATE_MAX)|| (parity>=SERIAL_PARITY_MAX) ||
		(bits>=SERIAL_BYTE_BITS_MAX) || (stop>=SERIAL_STOP_MAX))
		return FALSE;

	if(!handler)
		return FALSE;

#if (defined(APP_OS))
	if(abSerial_Used[port] == FALSE)
	{
		sprintf((char*)name, "Ser%u Lock Sem", (port+1));
		os_err = BSP_OS_SemCreate(&Serial_TXLockSem[port],     1, name);
		if (os_err == DEF_FAIL) return FALSE;
	}
#endif  //#if (defined(APP_OS))

    usart_init.USART_BaudRate            = Serial_BaudrateDict[baud];
    usart_init.USART_WordLength          = (parity!=SERIAL_PARITY_NONE)?USART_WordLength_9b:Serial_ByteBitsDict[bits];;
    usart_init.USART_StopBits            = Serial_StopBitsDict[stop];
    usart_init.USART_Parity              = Serial_ParityDict[parity] ;
    usart_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart_init.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;

