LeeXingyu/GAS_master/STM32Lib/UserLib/cpu/src/STM32Fxxx_Serial.c
    usart_clk_init.USART_Clock           = USART_Clock_Disable;
    usart_clk_init.USART_CPOL            = USART_CPOL_Low;
    usart_clk_init.USART_CPHA            = USART_CPHA_2Edge;
    usart_clk_init.USART_LastBit         = USART_LastBit_Disable;

    Serial_GPIOInit[port]();

    USART_Init((USART_TypeDef *)Serial_PERIPH_ID[port], &usart_init);
    USART_ClockInit((USART_TypeDef *)Serial_PERIPH_ID[port], &usart_clk_init);
    USART_Cmd((USART_TypeDef *)Serial_PERIPH_ID[port], ENABLE);

    USART_ITConfig((USART_TypeDef *)Serial_PERIPH_ID[port], USART_IT_TC, DISABLE);
    USART_ITConfig((USART_TypeDef *)Serial_PERIPH_ID[port], USART_IT_TXE, DISABLE);
    tc_status  = USART_GetFlagStatus((USART_TypeDef *)Serial_PERIPH_ID[port], USART_FLAG_TC);

    while (tc_status == SET)
    {
        USART_ClearITPendingBit((USART_TypeDef *)Serial_PERIPH_ID[port], USART_IT_TC);
        USART_ClearFlag((USART_TypeDef *)Serial_PERIPH_ID[port], USART_IT_TC);
        BSP_OS_TimeDlyMs(10);
        tc_status = USART_GetFlagStatus((USART_TypeDef *)Serial_PERIPH_ID[port], USART_FLAG_TC);
    }

    Serial_RxHandler[port] = handler;
	USART_ITConfig((USART_TypeDef *)Serial_PERIPH_ID[port], USART_IT_RXNE, ENABLE);
#if (defined(APP_OS))
    BSP_IntVectSet(Serial_INT_ID[port], Serial_EventISR_Handler[port]);
    BSP_IntEn(Serial_INT_ID[port]);
#else
#if (defined(STM32F1XX))
    NVIC_SetPriority(a_SerialISRTypePrio[port].irq_type, NVIC_EncodePriority(NVIC_PRIORITY_GROUP, a_SerialISRTypePrio[port].pre_prio, a_SerialISRTypePrio[port].sub_prio));
#elif (defined(STM32F4XX))
    
#elif (defined(STM32F0XX))
    NVIC_SetPriority(a_SerialISRTypePrio[port].irq_type, a_SerialISRTypePrio[port].pre_prio);
#endif  //#if (defined(STM32F1XX))
    NVIC_EnableIRQ(a_SerialISRTypePrio[port].irq_type);
#endif  //#if (defined(APP_OS))

#if (defined(APP_OS))
    abSerial_Used[port] = TRUE;
#endif  //#if (defined(APP_OS))

    return TRUE;
}

/****************************************************************************************
* 函数名称: STM32Fxxx_ExtiISREnable()
* 功能描述: 串口中断允许
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_SerialISREnable(SERIAL_Port port)
{
    if(port >= SERIAL_PORT_MAX)
		return;
    
#if defined(APP_OS)
    BSP_IntEn(Serial_INT_ID[port]);
#else
    NVIC_EnableIRQ(a_SerialISRTypePrio[port].irq_type);
#endif  //#if defined(APP_OS)
}

/****************************************************************************************
* 函数名称: STM32Fxxx_SerialISRDisable()
* 功能描述: 串口中断禁止
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_SerialISRDisable(SERIAL_Port port)
{
    if(port >= SERIAL_PORT_MAX)
		return;
    
#if defined(APP_OS)
    BSP_IntDis(Serial_INT_ID[port]);
#else
    NVIC_DisableIRQ(a_SerialISRTypePrio[port].irq_type);
#endif  //#if defined(APP_OS)
}

#if defined(APP_OS)
/****************************************************************************************
* 函数名称: STM32Fxxx_SerialLock()
* 功能描述: 锁定串口
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
BOOL STM32Fxxx_SerialLock(SERIAL_Port port, CPU_INT32U dly_ms)
{
    if(port>=SERIAL_PORT_MAX)
		return FALSE;
    
//    if(Serial_TXSem[port]==NULL)
//        return FALSE;
    
	return (BSP_OS_SemWaitFlag(&Serial_TXLockSem[port], dly_ms)==DEF_TRUE)?TRUE:FALSE;
}

/****************************************************************************************
* 函数名称: STM32Fxxx_SerialUnlock()
* 功能描述: 解锁串口
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
BOOL STM32Fxxx_SerialUnlock(SERIAL_Port port)
{
    if(port>=SERIAL_PORT_MAX)
		return FALSE;

//    if(Serial_TXSem[port]==NULL)
//        return FALSE;

	BSP_OS_SemPostFlag(&Serial_TXLockSem[port]);

	return TRUE;
}
#endif  //#if defined(APP_OS)

/****************************************************************************************
* 函数名称: STM32Fxxx_SerialWriteByte()
* 功能描述: 发送数据
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
BOOL STM32Fxxx_SerialWriteByte(SERIAL_Port port, char byte)
{
	if(port >= SERIAL_PORT_MAX)
		return FALSE;

    USART_SendData((USART_TypeDef *)Serial_PERIPH_ID[port], byte);
    while(USART_GetFlagStatus((USART_TypeDef *)Serial_PERIPH_ID[port], USART_FLAG_TXE) == RESET)	  // Loop until USARTy DR register is empty
    {
    }

	return TRUE;
}

/****************************************************************************************
* 函数名称: STM32Fxxx_SerialWriteBlock()
* 功能描述: 发送数据
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
BOOL STM32Fxxx_SerialWriteBlock(SERIAL_Port port, char *payload, int length)
{
	if(port>=SERIAL_PORT_MAX)
		return FALSE;

	return TRUE;
}

/****************************************************************************************
* 函数名称: STM32Fxxx_Serail_EventISR_Handler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Serail_EventISR_Handler(SERIAL_Port port)
{
	USART_TypeDef 	*uart = (USART_TypeDef 	*)Serial_PERIPH_ID[port];
//    FlagStatus 		rxne_status;
    int		  		c;
    
//    __disable_irq();
    
    if (SET == USART_GetFlagStatus(uart, USART_FLAG_RXNE)) 
    {
        c = USART_ReceiveData(uart) & 0xFF;
        USART_ClearITPendingBit(uart, USART_IT_RXNE);
        if(Serial_RxHandler[port])
        	Serial_RxHandler[port](c);
    }
    
//    __enable_irq();
}

/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser1GPIOInit(void)
{
#if (defined(STM32FXXX_SERIAL1_ENABLE)&&STM32FXXX_SERIAL1_ENABLE)

	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART1_PERIPH_ID);
    BSP_PeriphEn(UART1_TX_PERIPH_ID);
    BSP_PeriphEn(UART1_RX_PERIPH_ID);
#else
#if defined(STM32F1XX)
    RCC_APB2PeriphClockCmd(UART1_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART1_TX_PERIPH_ID | UART1_RX_PERIPH_ID, ENABLE);
#elif (defined(STM32F4XX))
    
#elif (defined(STM32F0XX))
    RCC_APB2PeriphClockCmd(UART1_PERIPH_ID, ENABLE);
    RCC_AHBPeriphClockCmd(UART1_TX_PERIPH_ID | UART1_RX_PERIPH_ID, ENABLE);
#endif  //#if defined(STM32F1XX)
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART1_REMAP_ENABLE
    GPIO_PinRemapConfig(UART1_REMAP_ID, ENABLE);
#endif                                                         
                                                               
    gpio_init.GPIO_Pin   = UART1_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART1_TX_PORT, &gpio_init);

                                                            
    gpio_init.GPIO_Pin   = UART1_RX_PIN;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(UART1_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;					
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART1_TX_PIN;
	GPIO_Init(UART1_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART1_RX_PIN;				
	GPIO_Init(UART1_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART1_TX_PORT, UART1_TX_PIN_SOURCE, UART1_TX_AF);	
	GPIO_PinAFConfig(UART1_RX_PORT, UART1_RX_PIN_SOURCE, UART1_RX_AF);	
#endif //:~STM32F4XX

