LeeXingyu/GAS_master/STM32Lib/UserLib/cpu/src/STM32Fxxx_Serial.c
#if defined(STM32F0XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART1_TX_PIN;
	GPIO_Init(UART1_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART1_RX_PIN;				
	GPIO_Init(UART1_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART1_TX_PORT, UART1_TX_PIN_SOURCE, UART1_TX_PIN_AF);	
	GPIO_PinAFConfig(UART1_RX_PORT, UART1_RX_PIN_SOURCE, UART1_RX_PIN_AF);	
#endif  //#if defined(STM32F0XX)
#endif
}

/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser2GPIOInit(void)
{
#if STM32FXXX_SERIAL2_ENABLE
	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART2_PERIPH_ID);
    BSP_PeriphEn(UART2_TX_PERIPH_ID);
    BSP_PeriphEn(UART2_RX_PERIPH_ID);
#else
    RCC_APB1PeriphClockCmd(UART2_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART2_TX_PERIPH_ID | UART2_RX_PERIPH_ID, ENABLE);
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART2_REMAP_ENABLE
    GPIO_PinRemapConfig(UART2_REMAP_ID, ENABLE);
#endif

    gpio_init.GPIO_Pin   = UART2_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART2_TX_PORT, &gpio_init);

    gpio_init.GPIO_Pin   = UART2_RX_PIN;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(UART2_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART2_TX_PIN;
	GPIO_Init(UART2_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART2_RX_PIN;
	GPIO_Init(UART2_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART2_TX_PORT, UART2_TX_PIN_SOURCE, UART2_TX_AF);
	GPIO_PinAFConfig(UART2_RX_PORT, UART2_RX_PIN_SOURCE, UART2_RX_AF);
#endif //:~STM32F4XX

#endif //:~STM32FXXX_SERIAL2_ENABLE
}

/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser3GPIOInit(void)
{
#if STM32FXXX_SERIAL3_ENABLE
	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART3_PERIPH_ID);
    BSP_PeriphEn(UART3_TX_PERIPH_ID);
    BSP_PeriphEn(UART3_RX_PERIPH_ID);
#else
    RCC_APB1PeriphClockCmd(UART3_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART3_TX_PERIPH_ID | UART3_RX_PERIPH_ID, ENABLE);
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART3_REMAP_ENABLE
    GPIO_PinRemapConfig(UART3_REMAP_ID, ENABLE);
#endif                                                               
                                                          
    gpio_init.GPIO_Pin   = UART3_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART3_TX_PORT, &gpio_init);

                                                               
    gpio_init.GPIO_Pin   = UART3_RX_PIN;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(UART3_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;					
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART3_TX_PIN;
	GPIO_Init(UART3_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART3_RX_PIN;				
	GPIO_Init(UART3_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART3_TX_PORT, UART3_TX_PIN_SOURCE, UART3_TX_AF);	
	GPIO_PinAFConfig(UART3_RX_PORT, UART3_RX_PIN_SOURCE, UART3_RX_AF);	
#endif //:~STM32F4XX
#endif
}

/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser4GPIOInit(void)
{
#if STM32FXXX_SERIAL4_ENABLE
	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART4_PERIPH_ID);
    BSP_PeriphEn(UART4_TX_PERIPH_ID);
    BSP_PeriphEn(UART4_RX_PERIPH_ID);
#else
    RCC_APB1PeriphClockCmd(UART4_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART4_TX_PERIPH_ID | UART4_RX_PERIPH_ID, ENABLE);
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART4_REMAP_ENABLE
    GPIO_PinRemapConfig(UART4_REMAP_ID, ENABLE);
#endif                                                               
                                                              
    gpio_init.GPIO_Pin   = UART4_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART4_TX_PORT, &gpio_init);

                                                                
    gpio_init.GPIO_Pin   = UART4_RX_PIN;
    //gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;

	gpio_init.GPIO_Mode = GPIO_Mode_IPU;

    GPIO_Init(UART4_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;					
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART4_TX_PIN;
	GPIO_Init(UART4_TX_PORT, &gpio_init);

