LeeXingyu/GAS_master/STM32Lib/UserLib/cpu/src/STM32Fxxx_Serial.c
	gpio_init.GPIO_Pin 		= UART4_RX_PIN;				
	GPIO_Init(UART4_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART4_TX_PORT, UART4_TX_PIN_SOURCE, UART4_TX_AF);	
	GPIO_PinAFConfig(UART4_RX_PORT, UART4_RX_PIN_SOURCE, UART4_RX_AF);	
#endif //:~STM32F4XX
#endif
}

#if (defined(STM32F1XX) || defined(STM32F4XX))
/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser5GPIOInit(void)
{
#if STM32FXXX_SERIAL5_ENABLE
	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART5_PERIPH_ID);
    BSP_PeriphEn(UART5_TX_PERIPH_ID);
    BSP_PeriphEn(UART5_RX_PERIPH_ID);
#else
    RCC_APB1PeriphClockCmd(UART5_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART5_TX_PERIPH_ID | UART5_RX_PERIPH_ID, ENABLE);
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART5_REMAP_ENABLE
    GPIO_PinRemapConfig(UART5_REMAP_ID, ENABLE);
#endif                                                                
                                                                
    gpio_init.GPIO_Pin   = UART5_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART5_TX_PORT, &gpio_init);

                                                              
    gpio_init.GPIO_Pin   = UART5_RX_PIN;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(UART5_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;					
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART5_TX_PIN;
	GPIO_Init(UART5_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART5_RX_PIN;				
	GPIO_Init(UART5_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART5_TX_PORT, UART5_TX_PIN_SOURCE, UART5_TX_AF);	
	GPIO_PinAFConfig(UART5_RX_PORT, UART5_RX_PIN_SOURCE, UART5_RX_AF);	
#endif //:~STM32F4XX
#endif
}
#endif  //#if (defined(STM32F1XX) || defined(STM32F4XX))

#if defined(STM32F4XX)
/****************************************************************************************
* 函数名称: STM32Fxxx_Ser1GPIOInit()
* 功能描述: IO初始化
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
static void STM32Fxxx_Ser6GPIOInit(void)
{
#if STM32FXXX_SERIAL6_ENABLE

	GPIO_InitTypeDef        gpio_init;

#if (defined(APP_OS))
    BSP_PeriphEn(UART6_PERIPH_ID);
    BSP_PeriphEn(UART6_TX_PERIPH_ID);
    BSP_PeriphEn(UART6_RX_PERIPH_ID);
#else
    RCC_APB1PeriphClockCmd(UART6_PERIPH_ID, ENABLE);
    RCC_APB2PeriphClockCmd(UART6_TX_PERIPH_ID | UART6_RX_PERIPH_ID, ENABLE);
#endif  //#if (defined(APP_OS))

#if defined(STM32F1XX)
#if (defined(APP_OS))
    BSP_PeriphEn(BSP_PERIPH_ID_AFIO);
#else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
#endif  //#if (defined(APP_OS))

#if UART6_REMAP_ENABLE
    GPIO_PinRemapConfig(UART6_REMAP_ID, ENABLE);
#endif                                                                
                                                                
    gpio_init.GPIO_Pin   = UART6_TX_PIN;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(UART6_TX_PORT, &gpio_init);

                                                                
    gpio_init.GPIO_Pin   = UART6_RX_PIN;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
    GPIO_Init(UART6_RX_PORT, &gpio_init);

#endif //:~STM32F1XX

#if defined(STM32F4XX)
    gpio_init.GPIO_OType 	= GPIO_OType_PP;					
    gpio_init.GPIO_PuPd 	= GPIO_PuPd_UP;
    gpio_init.GPIO_Mode 	= GPIO_Mode_AF;
    gpio_init.GPIO_Speed 	= GPIO_Speed_50MHz;
    gpio_init.GPIO_Pin 		= UART6_TX_PIN;
	GPIO_Init(UART6_TX_PORT, &gpio_init);

	gpio_init.GPIO_Pin 		= UART6_RX_PIN;				
	GPIO_Init(UART6_RX_PORT, &gpio_init);

	GPIO_PinAFConfig(UART6_TX_PORT, UART6_TX_PIN_SOURCE, UART6_TX_AF);	
	GPIO_PinAFConfig(UART6_RX_PORT, UART6_RX_PIN_SOURCE, UART6_RX_AF);	
#endif //:~STM32F4XX
#endif
}
#endif  //defined(STM32F4XX)

#if (defined(APP_OS))
/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail1_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT1);
}

/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail2_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT2);
}

/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail3_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT3);
}

/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail4_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT4);
}

/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail5_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT5);
}

#if defined(STM32F4XX)
/****************************************************************************************
* 函数名称: 
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void STM32Fxxx_Serail6_EventISR_Handler(void)
{
	STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT6);
}
#endif //:~STM32F4XX
#else
/****************************************************************************************
* 函数名称: USART1_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART1_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT1);
}

/****************************************************************************************
* 函数名称: USART2_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART2_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT2);
}

/****************************************************************************************
* 函数名称: USART3_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART3_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT3);
}

#if defined(STM32F1XX)
/****************************************************************************************
* 函数名称: UART4_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void UART4_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT4);
}

/****************************************************************************************
* 函数名称: UART5_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void UART5_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT5);
}
#elif (defined(STM32F4XX))
/****************************************************************************************
* 函数名称: USART4_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART4_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT4);
}

/****************************************************************************************
* 函数名称: USART5_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART5_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT5);
}

/****************************************************************************************
* 函数名称: USART6_IRQHandler()
* 功能描述: 中断函数
* 入口参数: 
* 出口参数: 
* 返回值  : 
* 其它    : 
****************************************************************************************/
void USART6_IRQHandler(void)
{
    STM32Fxxx_Serail_EventISR_Handler(SERIAL_PORT6);
}
#endif  //#if defined(STM32F1XX)
#endif  //#if (defined(APP_OS))

/*******************************版权所有(c)**************END OF FILE********************/
